{"pageId":"507","pageTitle":"!!!How to bet on the NFL with bitcoin","layout":"blogPostPage","section":"blog","enabled":1,"content":"<h2>Bitcoin betting primer<\/h2>\r\n<p>If you’ve got this far without being too sure about what bitcoin is, read this <em>introduction to bitcoin first<\/em>. For those who are familiar with bitcoin, there are several ways it can be used for betting, but the differences are important and you need to take a step back in time to appreciate them.<\/p>\r\n<p>Gambling is generally first to adopt new technical innovations. With the birth of the internet, betting quickly moved online facilitated by traditional payment methods like bank and credit cards, and the emergence of new services e-wallets like Neteller or Paypal. The advantages that bitcoin has for betting over these traditional methods has seen rapid adoption by sportsbooks, but not all are as they seem.<\/p>\r\n<p>A Spread essentially accounts for the number of points each side is expected to win or lose by to artificially create an even matchup.<\/p>\r\n<blockquote>A Spread essentially accounts for the number of points each side is expected to win or lose by to artificially create an even matchup.<\/blockquote>\r\n<p>Some traditional sportsbooks working with fiat currencies (Dollars and Euros) - market themselves as accepting bitcoin but this is for deposit only. Your bitcoin is converted into Euros or Dollars for betting, and then back again when you want to withdraw. This has many drawbacks which are discussed in more detail here - how bitcoin betting works.<\/p>\r\n<p>Cloudbet operate differently, as we are a pure bitcoin sportsbook. You deposit in bitcoin and can then bet on the NFL in bitcoin. This also means that your bets are paid in bitcoin, and subject to its fluctuation (and potential appreciation) making it in effect two bets in one. You are then able to take advantage of ease of transaction with bitcoin by instantly withdrawing any winnings. With the primer out of the way, let’s run through the markets available for betting on the NFL with bitcoin.<\/p>\r\n<h3>NFL bet types - Spread, Money Line & Totals<\/h3>\r\n<p>An <strong>NFL Point Spread<\/strong> is a bet that one side of an NFL matchup will score more points than the Cloudbet odds predict, as indicated by a positive or negative point Spread.<\/p>\r\n<p>The Spread is the most common way to bet on NFL at Cloudbet. A Spread essentially accounts for the number of points each side is expected to win or lose by to artificially create an even matchup. A Team with a negative spread - such as -7 points - is expected to win by that margin; conversely the opposition receives 7 points to balance the expectation that they will lose by that number.&nbsp;<\/p>\r\n<p>An NFL Spread might therefore look like this:<\/p>\r\n<ul><li>Seattle Seahawks (-7) 1.94 - €10 stake returns €19.40 [€10 stake + €9.40 profit]<\/li><li>New York Giants (+7) 1.94 - €10 stake returns €19.40 [€10 stake + €9.40 profit]<\/li><\/ul>\r\n<p>In the case above, to win a Spread bet on the Seahawks as favourite (-7) they must win by at least eight points to exceed our expectation - called covering the spread. To win on the Giants - the underdog - they must win the game or lose by less than seven points to cover the Spread. If the favourite wins by seven points or the underdog losing by exactly seven points it would be graded a push and Cloudbet would refund all bets.<\/p>\r\n<p>An <strong>NFL Total bet<\/strong> - also known as an Over\/Under - is a bet that the expected aggregate points total of a game will be Over or Under the number set by Cloudbet. The Total enables you to focus just on the number of points a game will produce rather than who will win (the Money Line) or the margin of victory (the Spread).<\/p>\r\n<p>An NFL Total might therefore look like this:<\/p>\r\n<ul><li>Seattle Seahawks (Over 40) 1.94 - €10 stake returns €19.40 [€10 stake + €9.40 profit]<\/li><li>New York Giants (Under 40) 1.94 - €10 stake returns €19.40 [€10 stake + €9.40 profit]<\/li><\/ul>\r\n<p>To win an NFL Total bet on the Over for this game would need the sum of points scored by Seattle and New York to be more than 40. Conversely, a successful bet on the Under would need the sum of points scored by Seattle and New York to be less than 40. If the combined score is exactly 40 than the Cloudbet got it spot on and your bet is refunded.<\/p>\r\n<p><strong>The Money Line<\/strong> is the simplest NFL bet type as the odds simply represent a given return for the team winning the game. A Money Line might look this:<\/p>\r\n<ul><li>Seattle Seahawks 1.34 - €10 stake returns €13.40 [€10 stake + €3.40 profit]<\/li><li>New York Giants 3.55 - €10 stake returns €35.50 [€10 stake + €25.50 profit]<\/li><\/ul>\r\n<p>In this bet the Seahawks are favoured to win because the odds provide a smaller return - Cloudbet think that outcome is more likely. Conversely, the Giants are considered the underdog - less likely to win - with your NFL bitcoin bet returning a bigger payout for that scenario.<\/p>\r\n<p>For these three basic bet types you will find that you that can apply to the whole game, or just portions of the game, such as a Spread of Total bet on just the first half or quarter, with bet working in exactly the same way.<\/p>\r\n<h3>NFL bet types - Outrights & Props<\/h3>\r\n<p>Outside of the three basic NFL bet types there are numerous ways to bet on events within a game - called NFL Prop bets - or events that span a season - known as <strong>Outright NFL bets<\/strong>.<\/p>\r\n<p>These deserve more explanation in their own right but Props or Specials are essentially Money Line bets on very specific game events such as whether a player will score a touchdown, or whether there will be sack in the game. They are normally binary - will player x score a TD odds for yes vs odds for no.<\/p>\r\n<p>Outrights are similar, in that again they relate to a specific event happening, but are focused on the outcome of a league or tournament. ‘Who will win the Super Bowl’ is the most common outright NFL bet type, but outright markets can also apply to who will a Conference of Division.<\/p>\r\n<h2>Ready to bet on the NFL with bitcoin?<\/h2>\r\n<p>You should now be clear about how betting with bitcoin works, and the huge range of opportunities to bet on the NFL at Cloudbet. If you still need convincing of the benefits of betting with bitcoin, the Cloud Blog has plenty of content to convince that it represents not just the future of betting, but of money too. Don’t be left behind.<\/p>","templateVariables":{"category":{"title":"bitcoin-gambling","slug":"bitcoin-gambling"},"summary":"If your a fan of both crypto and American Football betting and want to know how to bet on the NFL with bitcoin, then this article provide everything you need to get started at Cloudbet, the world's leading bitcoin sportsbook.","summaryBullets":["Bitcoin betting primer","Betting on the NFL with bitcoin","The most popular NFL bets","NFL Specials & Outrights"],"boilerplateText":"","tags":[{"title":"nfl","slug":"nfl"},{"title":"bitcoin-101","slug":"bitcoin-101"}],"articleOfInterest":false,"readingTime":"5 mins","buttons":[{"link":"https:\/\/www.cloudbet.com\/en\/players\/sign_up","text":"Sign Up Now","style":"primary"}],"customCss":"","mobileCustomCss":"","translationPriority":"low","translationComplete":true,"meta":{"title":"How to be on NFL with bitcoin | NFL betting with bitcoin","description":"Find out how to bet on the NFL with bitcoin at Cloudbet, the world’s most established and secure bitcoin sportsbook and casino"}}}